espressif/esp-idf/components/soc/esp32p4/include/soc/sys_clkrst_reg.h
/*
 * SPDX-FileCopyrightText: 2017-2023 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#ifndef _SOC_SYS_CLKRST_REG_H_
#define _SOC_SYS_CLKRST_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"

#define SYS_CLKRST_SYS_CLK_VER_DATE_REG          (DR_REG_SYS_CLKRST_BASE + 0x0)
/* SYS_CLKRST_VER_DATE : R/W ;bitpos:[31:0] ;default: 32'h20210610 ; */
/*description: .*/
#define SYS_CLKRST_VER_DATE    0xFFFFFFFF
#define SYS_CLKRST_VER_DATE_M  ((SYS_CLKRST_VER_DATE_V)<<(SYS_CLKRST_VER_DATE_S))
#define SYS_CLKRST_VER_DATE_V  0xFFFFFFFF
#define SYS_CLKRST_VER_DATE_S  0

#define SYS_CLKRST_SYS_ICM_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x4)
/* SYS_CLKRST_SYS_ICM_APB_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: system icm clock enable.*/
#define SYS_CLKRST_SYS_ICM_APB_CLK_EN    (BIT(0))
#define SYS_CLKRST_SYS_ICM_APB_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_SYS_ICM_APB_CLK_EN_V  0x1
#define SYS_CLKRST_SYS_ICM_APB_CLK_EN_S  0

#define SYS_CLKRST_JPEG_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x8)
/* SYS_CLKRST_JPEG_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define SYS_CLKRST_JPEG_CLK_CUR_DIV_NUM    0x000000FF
#define SYS_CLKRST_JPEG_CLK_CUR_DIV_NUM_M  ((SYS_CLKRST_JPEG_CLK_CUR_DIV_NUM_V)<<(SYS_CLKRST_JPEG_CLK_CUR_DIV_NUM_S))
#define SYS_CLKRST_JPEG_CLK_CUR_DIV_NUM_V  0xFF
#define SYS_CLKRST_JPEG_CLK_CUR_DIV_NUM_S  24
/* SYS_CLKRST_JPEG_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: clock phase offset compare to hp clock sync signal.*/
#define SYS_CLKRST_JPEG_CLK_PHASE_OFFSET    0x000000FF
#define SYS_CLKRST_JPEG_CLK_PHASE_OFFSET_M  ((SYS_CLKRST_JPEG_CLK_PHASE_OFFSET_V)<<(SYS_CLKRST_JPEG_CLK_PHASE_OFFSET_S))
#define SYS_CLKRST_JPEG_CLK_PHASE_OFFSET_V  0xFF
#define SYS_CLKRST_JPEG_CLK_PHASE_OFFSET_S  16
/* SYS_CLKRST_JPEG_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define SYS_CLKRST_JPEG_CLK_DIV_NUM    0x000000FF
#define SYS_CLKRST_JPEG_CLK_DIV_NUM_M  ((SYS_CLKRST_JPEG_CLK_DIV_NUM_V)<<(SYS_CLKRST_JPEG_CLK_DIV_NUM_S))
#define SYS_CLKRST_JPEG_CLK_DIV_NUM_V  0xFF
#define SYS_CLKRST_JPEG_CLK_DIV_NUM_S  8
/* SYS_CLKRST_JPEG_FORCE_NORST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: software force no reset.*/
#define SYS_CLKRST_JPEG_FORCE_NORST    (BIT(5))
#define SYS_CLKRST_JPEG_FORCE_NORST_M  (BIT(5))
#define SYS_CLKRST_JPEG_FORCE_NORST_V  0x1
#define SYS_CLKRST_JPEG_FORCE_NORST_S  5
/* SYS_CLKRST_JPEG_RSTN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: software reset : low active.*/
#define SYS_CLKRST_JPEG_RSTN    (BIT(4))
#define SYS_CLKRST_JPEG_RSTN_M  (BIT(4))
#define SYS_CLKRST_JPEG_RSTN_V  0x1
#define SYS_CLKRST_JPEG_RSTN_S  4
/* SYS_CLKRST_JPEG_APB_CLK_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: apb clock enable.*/
#define SYS_CLKRST_JPEG_APB_CLK_EN    (BIT(3))
#define SYS_CLKRST_JPEG_APB_CLK_EN_M  (BIT(3))
#define SYS_CLKRST_JPEG_APB_CLK_EN_V  0x1
#define SYS_CLKRST_JPEG_APB_CLK_EN_S  3
/* SYS_CLKRST_JPEG_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: clock force sync enable : clock output only available when clock is synced.*/
#define SYS_CLKRST_JPEG_CLK_FORCE_SYNC_EN    (BIT(2))
#define SYS_CLKRST_JPEG_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define SYS_CLKRST_JPEG_CLK_FORCE_SYNC_EN_V  0x1
#define SYS_CLKRST_JPEG_CLK_FORCE_SYNC_EN_S  2
/* SYS_CLKRST_JPEG_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: clock sync enable : will adjust clock phase when receive clock sync signal.*/
#define SYS_CLKRST_JPEG_CLK_SYNC_EN    (BIT(1))
#define SYS_CLKRST_JPEG_CLK_SYNC_EN_M  (BIT(1))
#define SYS_CLKRST_JPEG_CLK_SYNC_EN_V  0x1
#define SYS_CLKRST_JPEG_CLK_SYNC_EN_S  1
/* SYS_CLKRST_JPEG_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define SYS_CLKRST_JPEG_CLK_EN    (BIT(0))
#define SYS_CLKRST_JPEG_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_JPEG_CLK_EN_V  0x1
#define SYS_CLKRST_JPEG_CLK_EN_S  0

#define SYS_CLKRST_GFX_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0xC)
/* SYS_CLKRST_GFX_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define SYS_CLKRST_GFX_CLK_CUR_DIV_NUM    0x000000FF
#define SYS_CLKRST_GFX_CLK_CUR_DIV_NUM_M  ((SYS_CLKRST_GFX_CLK_CUR_DIV_NUM_V)<<(SYS_CLKRST_GFX_CLK_CUR_DIV_NUM_S))
#define SYS_CLKRST_GFX_CLK_CUR_DIV_NUM_V  0xFF
#define SYS_CLKRST_GFX_CLK_CUR_DIV_NUM_S  24
/* SYS_CLKRST_GFX_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: clock phase offset compare to hp clock sync signal.*/
#define SYS_CLKRST_GFX_CLK_PHASE_OFFSET    0x000000FF
#define SYS_CLKRST_GFX_CLK_PHASE_OFFSET_M  ((SYS_CLKRST_GFX_CLK_PHASE_OFFSET_V)<<(SYS_CLKRST_GFX_CLK_PHASE_OFFSET_S))
#define SYS_CLKRST_GFX_CLK_PHASE_OFFSET_V  0xFF
#define SYS_CLKRST_GFX_CLK_PHASE_OFFSET_S  16
/* SYS_CLKRST_GFX_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define SYS_CLKRST_GFX_CLK_DIV_NUM    0x000000FF
#define SYS_CLKRST_GFX_CLK_DIV_NUM_M  ((SYS_CLKRST_GFX_CLK_DIV_NUM_V)<<(SYS_CLKRST_GFX_CLK_DIV_NUM_S))
#define SYS_CLKRST_GFX_CLK_DIV_NUM_V  0xFF
#define SYS_CLKRST_GFX_CLK_DIV_NUM_S  8
/* SYS_CLKRST_GFX_FORCE_NORST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: software force no reset.*/
#define SYS_CLKRST_GFX_FORCE_NORST    (BIT(5))
#define SYS_CLKRST_GFX_FORCE_NORST_M  (BIT(5))
#define SYS_CLKRST_GFX_FORCE_NORST_V  0x1
#define SYS_CLKRST_GFX_FORCE_NORST_S  5
/* SYS_CLKRST_GFX_RSTN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: software reset : low active.*/
#define SYS_CLKRST_GFX_RSTN    (BIT(4))
#define SYS_CLKRST_GFX_RSTN_M  (BIT(4))
#define SYS_CLKRST_GFX_RSTN_V  0x1
#define SYS_CLKRST_GFX_RSTN_S  4
/* SYS_CLKRST_GFX_APB_CLK_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: apb clock enable.*/
#define SYS_CLKRST_GFX_APB_CLK_EN    (BIT(3))
#define SYS_CLKRST_GFX_APB_CLK_EN_M  (BIT(3))
#define SYS_CLKRST_GFX_APB_CLK_EN_V  0x1
#define SYS_CLKRST_GFX_APB_CLK_EN_S  3
/* SYS_CLKRST_GFX_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: clock force sync enable : clock output only available when clock is synced.*/
#define SYS_CLKRST_GFX_CLK_FORCE_SYNC_EN    (BIT(2))
#define SYS_CLKRST_GFX_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define SYS_CLKRST_GFX_CLK_FORCE_SYNC_EN_V  0x1
#define SYS_CLKRST_GFX_CLK_FORCE_SYNC_EN_S  2
/* SYS_CLKRST_GFX_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: clock sync enable : will adjust clock phase when receive clock sync signal.*/
#define SYS_CLKRST_GFX_CLK_SYNC_EN    (BIT(1))
#define SYS_CLKRST_GFX_CLK_SYNC_EN_M  (BIT(1))
#define SYS_CLKRST_GFX_CLK_SYNC_EN_V  0x1
#define SYS_CLKRST_GFX_CLK_SYNC_EN_S  1
/* SYS_CLKRST_GFX_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define SYS_CLKRST_GFX_CLK_EN    (BIT(0))
#define SYS_CLKRST_GFX_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_GFX_CLK_EN_V  0x1
#define SYS_CLKRST_GFX_CLK_EN_S  0

