espressif/esp-idf/components/soc/esp32p4/include/soc/sys_clkrst_reg.h
#define SYS_CLKRST_PSRAM_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x10)
/* SYS_CLKRST_PSRAM_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define SYS_CLKRST_PSRAM_CLK_CUR_DIV_NUM    0x000000FF
#define SYS_CLKRST_PSRAM_CLK_CUR_DIV_NUM_M  ((SYS_CLKRST_PSRAM_CLK_CUR_DIV_NUM_V)<<(SYS_CLKRST_PSRAM_CLK_CUR_DIV_NUM_S))
#define SYS_CLKRST_PSRAM_CLK_CUR_DIV_NUM_V  0xFF
#define SYS_CLKRST_PSRAM_CLK_CUR_DIV_NUM_S  24
/* SYS_CLKRST_PSRAM_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: clock phase offset compare to hp clock sync signal.*/
#define SYS_CLKRST_PSRAM_CLK_PHASE_OFFSET    0x000000FF
#define SYS_CLKRST_PSRAM_CLK_PHASE_OFFSET_M  ((SYS_CLKRST_PSRAM_CLK_PHASE_OFFSET_V)<<(SYS_CLKRST_PSRAM_CLK_PHASE_OFFSET_S))
#define SYS_CLKRST_PSRAM_CLK_PHASE_OFFSET_V  0xFF
#define SYS_CLKRST_PSRAM_CLK_PHASE_OFFSET_S  16
/* SYS_CLKRST_PSRAM_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define SYS_CLKRST_PSRAM_CLK_DIV_NUM    0x000000FF
#define SYS_CLKRST_PSRAM_CLK_DIV_NUM_M  ((SYS_CLKRST_PSRAM_CLK_DIV_NUM_V)<<(SYS_CLKRST_PSRAM_CLK_DIV_NUM_S))
#define SYS_CLKRST_PSRAM_CLK_DIV_NUM_V  0xFF
#define SYS_CLKRST_PSRAM_CLK_DIV_NUM_S  8
/* SYS_CLKRST_PSRAM_FORCE_NORST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: software force no reset.*/
#define SYS_CLKRST_PSRAM_FORCE_NORST    (BIT(5))
#define SYS_CLKRST_PSRAM_FORCE_NORST_M  (BIT(5))
#define SYS_CLKRST_PSRAM_FORCE_NORST_V  0x1
#define SYS_CLKRST_PSRAM_FORCE_NORST_S  5
/* SYS_CLKRST_PSRAM_RSTN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: software reset : low active.*/
#define SYS_CLKRST_PSRAM_RSTN    (BIT(4))
#define SYS_CLKRST_PSRAM_RSTN_M  (BIT(4))
#define SYS_CLKRST_PSRAM_RSTN_V  0x1
#define SYS_CLKRST_PSRAM_RSTN_S  4
/* SYS_CLKRST_PSRAM_APB_CLK_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: apb clock enable.*/
#define SYS_CLKRST_PSRAM_APB_CLK_EN    (BIT(3))
#define SYS_CLKRST_PSRAM_APB_CLK_EN_M  (BIT(3))
#define SYS_CLKRST_PSRAM_APB_CLK_EN_V  0x1
#define SYS_CLKRST_PSRAM_APB_CLK_EN_S  3
/* SYS_CLKRST_PSRAM_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: clock force sync enable : clock output only available when clock is synced.*/
#define SYS_CLKRST_PSRAM_CLK_FORCE_SYNC_EN    (BIT(2))
#define SYS_CLKRST_PSRAM_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define SYS_CLKRST_PSRAM_CLK_FORCE_SYNC_EN_V  0x1
#define SYS_CLKRST_PSRAM_CLK_FORCE_SYNC_EN_S  2
/* SYS_CLKRST_PSRAM_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: clock sync enable : will adjust clock phase when receive clock sync signal.*/
#define SYS_CLKRST_PSRAM_CLK_SYNC_EN    (BIT(1))
#define SYS_CLKRST_PSRAM_CLK_SYNC_EN_M  (BIT(1))
#define SYS_CLKRST_PSRAM_CLK_SYNC_EN_V  0x1
#define SYS_CLKRST_PSRAM_CLK_SYNC_EN_S  1
/* SYS_CLKRST_PSRAM_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define SYS_CLKRST_PSRAM_CLK_EN    (BIT(0))
#define SYS_CLKRST_PSRAM_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_PSRAM_CLK_EN_V  0x1
#define SYS_CLKRST_PSRAM_CLK_EN_S  0

#define SYS_CLKRST_MSPI_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x14)
/* SYS_CLKRST_MSPI_FORCE_NORST : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_MSPI_FORCE_NORST    (BIT(2))
#define SYS_CLKRST_MSPI_FORCE_NORST_M  (BIT(2))
#define SYS_CLKRST_MSPI_FORCE_NORST_V  0x1
#define SYS_CLKRST_MSPI_FORCE_NORST_S  2
/* SYS_CLKRST_MSPI_RSTN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_MSPI_RSTN    (BIT(1))
#define SYS_CLKRST_MSPI_RSTN_M  (BIT(1))
#define SYS_CLKRST_MSPI_RSTN_V  0x1
#define SYS_CLKRST_MSPI_RSTN_S  1
/* SYS_CLKRST_MSPI_APB_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_MSPI_APB_CLK_EN    (BIT(0))
#define SYS_CLKRST_MSPI_APB_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_MSPI_APB_CLK_EN_V  0x1
#define SYS_CLKRST_MSPI_APB_CLK_EN_S  0

#define SYS_CLKRST_DSI_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x18)
/* SYS_CLKRST_DSI_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define SYS_CLKRST_DSI_CLK_CUR_DIV_NUM    0x000000FF
#define SYS_CLKRST_DSI_CLK_CUR_DIV_NUM_M  ((SYS_CLKRST_DSI_CLK_CUR_DIV_NUM_V)<<(SYS_CLKRST_DSI_CLK_CUR_DIV_NUM_S))
#define SYS_CLKRST_DSI_CLK_CUR_DIV_NUM_V  0xFF
#define SYS_CLKRST_DSI_CLK_CUR_DIV_NUM_S  24
/* SYS_CLKRST_DSI_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: clock phase offset compare to hp clock sync signal.*/
#define SYS_CLKRST_DSI_CLK_PHASE_OFFSET    0x000000FF
#define SYS_CLKRST_DSI_CLK_PHASE_OFFSET_M  ((SYS_CLKRST_DSI_CLK_PHASE_OFFSET_V)<<(SYS_CLKRST_DSI_CLK_PHASE_OFFSET_S))
#define SYS_CLKRST_DSI_CLK_PHASE_OFFSET_V  0xFF
#define SYS_CLKRST_DSI_CLK_PHASE_OFFSET_S  16
/* SYS_CLKRST_DSI_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define SYS_CLKRST_DSI_CLK_DIV_NUM    0x000000FF
#define SYS_CLKRST_DSI_CLK_DIV_NUM_M  ((SYS_CLKRST_DSI_CLK_DIV_NUM_V)<<(SYS_CLKRST_DSI_CLK_DIV_NUM_S))
#define SYS_CLKRST_DSI_CLK_DIV_NUM_V  0xFF
#define SYS_CLKRST_DSI_CLK_DIV_NUM_S  8
/* SYS_CLKRST_DSI_FORCE_NORST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: software force no reset.*/
#define SYS_CLKRST_DSI_FORCE_NORST    (BIT(5))
#define SYS_CLKRST_DSI_FORCE_NORST_M  (BIT(5))
#define SYS_CLKRST_DSI_FORCE_NORST_V  0x1
#define SYS_CLKRST_DSI_FORCE_NORST_S  5
/* SYS_CLKRST_DSI_RSTN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: software reset : low active.*/
#define SYS_CLKRST_DSI_RSTN    (BIT(4))
#define SYS_CLKRST_DSI_RSTN_M  (BIT(4))
#define SYS_CLKRST_DSI_RSTN_V  0x1
#define SYS_CLKRST_DSI_RSTN_S  4
/* SYS_CLKRST_DSI_APB_CLK_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: apb clock enable.*/
#define SYS_CLKRST_DSI_APB_CLK_EN    (BIT(3))
#define SYS_CLKRST_DSI_APB_CLK_EN_M  (BIT(3))
#define SYS_CLKRST_DSI_APB_CLK_EN_V  0x1
#define SYS_CLKRST_DSI_APB_CLK_EN_S  3
/* SYS_CLKRST_DSI_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: clock force sync enable : clock output only available when clock is synced.*/
#define SYS_CLKRST_DSI_CLK_FORCE_SYNC_EN    (BIT(2))
#define SYS_CLKRST_DSI_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define SYS_CLKRST_DSI_CLK_FORCE_SYNC_EN_V  0x1
#define SYS_CLKRST_DSI_CLK_FORCE_SYNC_EN_S  2
/* SYS_CLKRST_DSI_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: clock sync enable : will adjust clock phase when receive clock sync signal.*/
#define SYS_CLKRST_DSI_CLK_SYNC_EN    (BIT(1))
#define SYS_CLKRST_DSI_CLK_SYNC_EN_M  (BIT(1))
#define SYS_CLKRST_DSI_CLK_SYNC_EN_V  0x1
#define SYS_CLKRST_DSI_CLK_SYNC_EN_S  1
/* SYS_CLKRST_DSI_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define SYS_CLKRST_DSI_CLK_EN    (BIT(0))
#define SYS_CLKRST_DSI_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_DSI_CLK_EN_V  0x1
#define SYS_CLKRST_DSI_CLK_EN_S  0

#define SYS_CLKRST_CSI_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x1C)
/* SYS_CLKRST_CSI_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define SYS_CLKRST_CSI_CLK_CUR_DIV_NUM    0x000000FF
#define SYS_CLKRST_CSI_CLK_CUR_DIV_NUM_M  ((SYS_CLKRST_CSI_CLK_CUR_DIV_NUM_V)<<(SYS_CLKRST_CSI_CLK_CUR_DIV_NUM_S))
#define SYS_CLKRST_CSI_CLK_CUR_DIV_NUM_V  0xFF
#define SYS_CLKRST_CSI_CLK_CUR_DIV_NUM_S  24
/* SYS_CLKRST_CSI_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: clock phase offset compare to hp clock sync signal.*/
#define SYS_CLKRST_CSI_CLK_PHASE_OFFSET    0x000000FF
#define SYS_CLKRST_CSI_CLK_PHASE_OFFSET_M  ((SYS_CLKRST_CSI_CLK_PHASE_OFFSET_V)<<(SYS_CLKRST_CSI_CLK_PHASE_OFFSET_S))
#define SYS_CLKRST_CSI_CLK_PHASE_OFFSET_V  0xFF
#define SYS_CLKRST_CSI_CLK_PHASE_OFFSET_S  16
/* SYS_CLKRST_CSI_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define SYS_CLKRST_CSI_CLK_DIV_NUM    0x000000FF
#define SYS_CLKRST_CSI_CLK_DIV_NUM_M  ((SYS_CLKRST_CSI_CLK_DIV_NUM_V)<<(SYS_CLKRST_CSI_CLK_DIV_NUM_S))
#define SYS_CLKRST_CSI_CLK_DIV_NUM_V  0xFF
#define SYS_CLKRST_CSI_CLK_DIV_NUM_S  8
/* SYS_CLKRST_CSI_BRG_RSTN : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: software reset : low active.*/
#define SYS_CLKRST_CSI_BRG_RSTN    (BIT(6))
#define SYS_CLKRST_CSI_BRG_RSTN_M  (BIT(6))
#define SYS_CLKRST_CSI_BRG_RSTN_V  0x1
#define SYS_CLKRST_CSI_BRG_RSTN_S  6
/* SYS_CLKRST_CSI_FORCE_NORST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: software force no reset.*/
#define SYS_CLKRST_CSI_FORCE_NORST    (BIT(5))
#define SYS_CLKRST_CSI_FORCE_NORST_M  (BIT(5))
#define SYS_CLKRST_CSI_FORCE_NORST_V  0x1
#define SYS_CLKRST_CSI_FORCE_NORST_S  5
/* SYS_CLKRST_CSI_RSTN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: software reset : low active.*/
#define SYS_CLKRST_CSI_RSTN    (BIT(4))
#define SYS_CLKRST_CSI_RSTN_M  (BIT(4))
#define SYS_CLKRST_CSI_RSTN_V  0x1
#define SYS_CLKRST_CSI_RSTN_S  4
/* SYS_CLKRST_CSI_APB_CLK_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: apb clock enable.*/
#define SYS_CLKRST_CSI_APB_CLK_EN    (BIT(3))
#define SYS_CLKRST_CSI_APB_CLK_EN_M  (BIT(3))
#define SYS_CLKRST_CSI_APB_CLK_EN_V  0x1
#define SYS_CLKRST_CSI_APB_CLK_EN_S  3
/* SYS_CLKRST_CSI_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: clock force sync enable : clock output only available when clock is synced.*/
#define SYS_CLKRST_CSI_CLK_FORCE_SYNC_EN    (BIT(2))
#define SYS_CLKRST_CSI_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define SYS_CLKRST_CSI_CLK_FORCE_SYNC_EN_V  0x1
#define SYS_CLKRST_CSI_CLK_FORCE_SYNC_EN_S  2
/* SYS_CLKRST_CSI_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: clock sync enable : will adjust clock phase when receive clock sync signal.*/
#define SYS_CLKRST_CSI_CLK_SYNC_EN    (BIT(1))
#define SYS_CLKRST_CSI_CLK_SYNC_EN_M  (BIT(1))
#define SYS_CLKRST_CSI_CLK_SYNC_EN_V  0x1
#define SYS_CLKRST_CSI_CLK_SYNC_EN_S  1
/* SYS_CLKRST_CSI_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define SYS_CLKRST_CSI_CLK_EN    (BIT(0))
#define SYS_CLKRST_CSI_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_CSI_CLK_EN_V  0x1
#define SYS_CLKRST_CSI_CLK_EN_S  0

