espressif/esp-idf/components/soc/esp32p4/include/soc/sys_clkrst_reg.h
#define SYS_CLKRST_USB_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x20)
/* SYS_CLKRST_USB_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define SYS_CLKRST_USB_CLK_CUR_DIV_NUM    0x000000FF
#define SYS_CLKRST_USB_CLK_CUR_DIV_NUM_M  ((SYS_CLKRST_USB_CLK_CUR_DIV_NUM_V)<<(SYS_CLKRST_USB_CLK_CUR_DIV_NUM_S))
#define SYS_CLKRST_USB_CLK_CUR_DIV_NUM_V  0xFF
#define SYS_CLKRST_USB_CLK_CUR_DIV_NUM_S  24
/* SYS_CLKRST_USB_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: clock phase offset compare to hp clock sync signal.*/
#define SYS_CLKRST_USB_CLK_PHASE_OFFSET    0x000000FF
#define SYS_CLKRST_USB_CLK_PHASE_OFFSET_M  ((SYS_CLKRST_USB_CLK_PHASE_OFFSET_V)<<(SYS_CLKRST_USB_CLK_PHASE_OFFSET_S))
#define SYS_CLKRST_USB_CLK_PHASE_OFFSET_V  0xFF
#define SYS_CLKRST_USB_CLK_PHASE_OFFSET_S  16
/* SYS_CLKRST_USB_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define SYS_CLKRST_USB_CLK_DIV_NUM    0x000000FF
#define SYS_CLKRST_USB_CLK_DIV_NUM_M  ((SYS_CLKRST_USB_CLK_DIV_NUM_V)<<(SYS_CLKRST_USB_CLK_DIV_NUM_S))
#define SYS_CLKRST_USB_CLK_DIV_NUM_V  0xFF
#define SYS_CLKRST_USB_CLK_DIV_NUM_S  8
/* SYS_CLKRST_USB_PHY_FORCE_NORST : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: Usb phy software force no reset.*/
#define SYS_CLKRST_USB_PHY_FORCE_NORST    (BIT(7))
#define SYS_CLKRST_USB_PHY_FORCE_NORST_M  (BIT(7))
#define SYS_CLKRST_USB_PHY_FORCE_NORST_V  0x1
#define SYS_CLKRST_USB_PHY_FORCE_NORST_S  7
/* SYS_CLKRST_USB_FORCE_NORST : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: Usb software force no reset.*/
#define SYS_CLKRST_USB_FORCE_NORST    (BIT(6))
#define SYS_CLKRST_USB_FORCE_NORST_M  (BIT(6))
#define SYS_CLKRST_USB_FORCE_NORST_V  0x1
#define SYS_CLKRST_USB_FORCE_NORST_S  6
/* SYS_CLKRST_USB_PHY_RSTN : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: Usb phy software reset : low active.*/
#define SYS_CLKRST_USB_PHY_RSTN    (BIT(5))
#define SYS_CLKRST_USB_PHY_RSTN_M  (BIT(5))
#define SYS_CLKRST_USB_PHY_RSTN_V  0x1
#define SYS_CLKRST_USB_PHY_RSTN_S  5
/* SYS_CLKRST_USB_RSTN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: Usb software reset : low active.*/
#define SYS_CLKRST_USB_RSTN    (BIT(4))
#define SYS_CLKRST_USB_RSTN_M  (BIT(4))
#define SYS_CLKRST_USB_RSTN_V  0x1
#define SYS_CLKRST_USB_RSTN_S  4
/* SYS_CLKRST_USB_APB_CLK_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: apb clock enable.*/
#define SYS_CLKRST_USB_APB_CLK_EN    (BIT(3))
#define SYS_CLKRST_USB_APB_CLK_EN_M  (BIT(3))
#define SYS_CLKRST_USB_APB_CLK_EN_V  0x1
#define SYS_CLKRST_USB_APB_CLK_EN_S  3
/* SYS_CLKRST_USB_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: clock force sync enable : clock output only available when clock is synced.*/
#define SYS_CLKRST_USB_CLK_FORCE_SYNC_EN    (BIT(2))
#define SYS_CLKRST_USB_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define SYS_CLKRST_USB_CLK_FORCE_SYNC_EN_V  0x1
#define SYS_CLKRST_USB_CLK_FORCE_SYNC_EN_S  2
/* SYS_CLKRST_USB_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: clock sync enable : will adjust clock phase when receive clock sync signal.*/
#define SYS_CLKRST_USB_CLK_SYNC_EN    (BIT(1))
#define SYS_CLKRST_USB_CLK_SYNC_EN_M  (BIT(1))
#define SYS_CLKRST_USB_CLK_SYNC_EN_V  0x1
#define SYS_CLKRST_USB_CLK_SYNC_EN_S  1
/* SYS_CLKRST_USB_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define SYS_CLKRST_USB_CLK_EN    (BIT(0))
#define SYS_CLKRST_USB_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_USB_CLK_EN_V  0x1
#define SYS_CLKRST_USB_CLK_EN_S  0

#define SYS_CLKRST_GMAC_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x24)
/* SYS_CLKRST_GMAC_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'b0 ; */
/*description: current clock divider number.*/
#define SYS_CLKRST_GMAC_CLK_CUR_DIV_NUM    0x000000FF
#define SYS_CLKRST_GMAC_CLK_CUR_DIV_NUM_M  ((SYS_CLKRST_GMAC_CLK_CUR_DIV_NUM_V)<<(SYS_CLKRST_GMAC_CLK_CUR_DIV_NUM_S))
#define SYS_CLKRST_GMAC_CLK_CUR_DIV_NUM_V  0xFF
#define SYS_CLKRST_GMAC_CLK_CUR_DIV_NUM_S  24
/* SYS_CLKRST_GMAC_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: clock phase offset compare to hp clock sync signal.*/
#define SYS_CLKRST_GMAC_CLK_PHASE_OFFSET    0x000000FF
#define SYS_CLKRST_GMAC_CLK_PHASE_OFFSET_M  ((SYS_CLKRST_GMAC_CLK_PHASE_OFFSET_V)<<(SYS_CLKRST_GMAC_CLK_PHASE_OFFSET_S))
#define SYS_CLKRST_GMAC_CLK_PHASE_OFFSET_V  0xFF
#define SYS_CLKRST_GMAC_CLK_PHASE_OFFSET_S  16
/* SYS_CLKRST_GMAC_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define SYS_CLKRST_GMAC_CLK_DIV_NUM    0x000000FF
#define SYS_CLKRST_GMAC_CLK_DIV_NUM_M  ((SYS_CLKRST_GMAC_CLK_DIV_NUM_V)<<(SYS_CLKRST_GMAC_CLK_DIV_NUM_S))
#define SYS_CLKRST_GMAC_CLK_DIV_NUM_V  0xFF
#define SYS_CLKRST_GMAC_CLK_DIV_NUM_S  8
/* SYS_CLKRST_GMAC_FORCE_NORST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: software force no reset.*/
#define SYS_CLKRST_GMAC_FORCE_NORST    (BIT(5))
#define SYS_CLKRST_GMAC_FORCE_NORST_M  (BIT(5))
#define SYS_CLKRST_GMAC_FORCE_NORST_V  0x1
#define SYS_CLKRST_GMAC_FORCE_NORST_S  5
/* SYS_CLKRST_GMAC_RSTN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: software reset : low active.*/
#define SYS_CLKRST_GMAC_RSTN    (BIT(4))
#define SYS_CLKRST_GMAC_RSTN_M  (BIT(4))
#define SYS_CLKRST_GMAC_RSTN_V  0x1
#define SYS_CLKRST_GMAC_RSTN_S  4
/* SYS_CLKRST_GMAC_APB_CLK_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: apb clock enable.*/
#define SYS_CLKRST_GMAC_APB_CLK_EN    (BIT(3))
#define SYS_CLKRST_GMAC_APB_CLK_EN_M  (BIT(3))
#define SYS_CLKRST_GMAC_APB_CLK_EN_V  0x1
#define SYS_CLKRST_GMAC_APB_CLK_EN_S  3
/* SYS_CLKRST_GMAC_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: clock force sync enable : clock output only available when clock is synced.*/
#define SYS_CLKRST_GMAC_CLK_FORCE_SYNC_EN    (BIT(2))
#define SYS_CLKRST_GMAC_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define SYS_CLKRST_GMAC_CLK_FORCE_SYNC_EN_V  0x1
#define SYS_CLKRST_GMAC_CLK_FORCE_SYNC_EN_S  2
/* SYS_CLKRST_GMAC_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: clock sync enable : will adjust clock phase when receive clock sync signal.*/
#define SYS_CLKRST_GMAC_CLK_SYNC_EN    (BIT(1))
#define SYS_CLKRST_GMAC_CLK_SYNC_EN_M  (BIT(1))
#define SYS_CLKRST_GMAC_CLK_SYNC_EN_V  0x1
#define SYS_CLKRST_GMAC_CLK_SYNC_EN_S  1
/* SYS_CLKRST_GMAC_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define SYS_CLKRST_GMAC_CLK_EN    (BIT(0))
#define SYS_CLKRST_GMAC_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_GMAC_CLK_EN_V  0x1
#define SYS_CLKRST_GMAC_CLK_EN_S  0

