espressif/esp-idf/components/soc/esp32p4/include/soc/sys_clkrst_reg.h
#define SYS_CLKRST_SDMMC_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x28)
/* SYS_CLKRST_SDMMC_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define SYS_CLKRST_SDMMC_CLK_CUR_DIV_NUM    0x000000FF
#define SYS_CLKRST_SDMMC_CLK_CUR_DIV_NUM_M  ((SYS_CLKRST_SDMMC_CLK_CUR_DIV_NUM_V)<<(SYS_CLKRST_SDMMC_CLK_CUR_DIV_NUM_S))
#define SYS_CLKRST_SDMMC_CLK_CUR_DIV_NUM_V  0xFF
#define SYS_CLKRST_SDMMC_CLK_CUR_DIV_NUM_S  24
/* SYS_CLKRST_SDMMC_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: clock phase offset compare to hp clock sync signal.*/
#define SYS_CLKRST_SDMMC_CLK_PHASE_OFFSET    0x000000FF
#define SYS_CLKRST_SDMMC_CLK_PHASE_OFFSET_M  ((SYS_CLKRST_SDMMC_CLK_PHASE_OFFSET_V)<<(SYS_CLKRST_SDMMC_CLK_PHASE_OFFSET_S))
#define SYS_CLKRST_SDMMC_CLK_PHASE_OFFSET_V  0xFF
#define SYS_CLKRST_SDMMC_CLK_PHASE_OFFSET_S  16
/* SYS_CLKRST_SDMMC_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define SYS_CLKRST_SDMMC_CLK_DIV_NUM    0x000000FF
#define SYS_CLKRST_SDMMC_CLK_DIV_NUM_M  ((SYS_CLKRST_SDMMC_CLK_DIV_NUM_V)<<(SYS_CLKRST_SDMMC_CLK_DIV_NUM_S))
#define SYS_CLKRST_SDMMC_CLK_DIV_NUM_V  0xFF
#define SYS_CLKRST_SDMMC_CLK_DIV_NUM_S  8
/* SYS_CLKRST_SDMMC_FORCE_NORST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: software force no reset.*/
#define SYS_CLKRST_SDMMC_FORCE_NORST    (BIT(5))
#define SYS_CLKRST_SDMMC_FORCE_NORST_M  (BIT(5))
#define SYS_CLKRST_SDMMC_FORCE_NORST_V  0x1
#define SYS_CLKRST_SDMMC_FORCE_NORST_S  5
/* SYS_CLKRST_SDMMC_RSTN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: software reset : low active.*/
#define SYS_CLKRST_SDMMC_RSTN    (BIT(4))
#define SYS_CLKRST_SDMMC_RSTN_M  (BIT(4))
#define SYS_CLKRST_SDMMC_RSTN_V  0x1
#define SYS_CLKRST_SDMMC_RSTN_S  4
/* SYS_CLKRST_SDMMC_APB_CLK_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: apb clock enable.*/
#define SYS_CLKRST_SDMMC_APB_CLK_EN    (BIT(3))
#define SYS_CLKRST_SDMMC_APB_CLK_EN_M  (BIT(3))
#define SYS_CLKRST_SDMMC_APB_CLK_EN_V  0x1
#define SYS_CLKRST_SDMMC_APB_CLK_EN_S  3
/* SYS_CLKRST_SDMMC_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: clock force sync enable : clock output only available when clock is synced.*/
#define SYS_CLKRST_SDMMC_CLK_FORCE_SYNC_EN    (BIT(2))
#define SYS_CLKRST_SDMMC_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define SYS_CLKRST_SDMMC_CLK_FORCE_SYNC_EN_V  0x1
#define SYS_CLKRST_SDMMC_CLK_FORCE_SYNC_EN_S  2
/* SYS_CLKRST_SDMMC_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: clock sync enable : will adjust clock phase when receive clock sync signal.*/
#define SYS_CLKRST_SDMMC_CLK_SYNC_EN    (BIT(1))
#define SYS_CLKRST_SDMMC_CLK_SYNC_EN_M  (BIT(1))
#define SYS_CLKRST_SDMMC_CLK_SYNC_EN_V  0x1
#define SYS_CLKRST_SDMMC_CLK_SYNC_EN_S  1
/* SYS_CLKRST_SDMMC_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define SYS_CLKRST_SDMMC_CLK_EN    (BIT(0))
#define SYS_CLKRST_SDMMC_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_SDMMC_CLK_EN_V  0x1
#define SYS_CLKRST_SDMMC_CLK_EN_S  0

#define SYS_CLKRST_DDRC_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x2C)
/* SYS_CLKRST_DDRC_FORCE_NORST : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_DDRC_FORCE_NORST    (BIT(2))
#define SYS_CLKRST_DDRC_FORCE_NORST_M  (BIT(2))
#define SYS_CLKRST_DDRC_FORCE_NORST_V  0x1
#define SYS_CLKRST_DDRC_FORCE_NORST_S  2
/* SYS_CLKRST_DDRC_RSTN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_DDRC_RSTN    (BIT(1))
#define SYS_CLKRST_DDRC_RSTN_M  (BIT(1))
#define SYS_CLKRST_DDRC_RSTN_V  0x1
#define SYS_CLKRST_DDRC_RSTN_S  1
/* SYS_CLKRST_DDRC_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_DDRC_CLK_EN    (BIT(0))
#define SYS_CLKRST_DDRC_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_DDRC_CLK_EN_V  0x1
#define SYS_CLKRST_DDRC_CLK_EN_S  0

#define SYS_CLKRST_GDMA_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x30)
/* SYS_CLKRST_GDMA_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: current clock divider number.*/
#define SYS_CLKRST_GDMA_CLK_CUR_DIV_NUM    0x000000FF
#define SYS_CLKRST_GDMA_CLK_CUR_DIV_NUM_M  ((SYS_CLKRST_GDMA_CLK_CUR_DIV_NUM_V)<<(SYS_CLKRST_GDMA_CLK_CUR_DIV_NUM_S))
#define SYS_CLKRST_GDMA_CLK_CUR_DIV_NUM_V  0xFF
#define SYS_CLKRST_GDMA_CLK_CUR_DIV_NUM_S  24
/* SYS_CLKRST_GDMA_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: clock phase offset compare to hp clock sync signal.*/
#define SYS_CLKRST_GDMA_CLK_PHASE_OFFSET    0x000000FF
#define SYS_CLKRST_GDMA_CLK_PHASE_OFFSET_M  ((SYS_CLKRST_GDMA_CLK_PHASE_OFFSET_V)<<(SYS_CLKRST_GDMA_CLK_PHASE_OFFSET_S))
#define SYS_CLKRST_GDMA_CLK_PHASE_OFFSET_V  0xFF
#define SYS_CLKRST_GDMA_CLK_PHASE_OFFSET_S  16
/* SYS_CLKRST_GDMA_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: clock divider number.*/
#define SYS_CLKRST_GDMA_CLK_DIV_NUM    0x000000FF
#define SYS_CLKRST_GDMA_CLK_DIV_NUM_M  ((SYS_CLKRST_GDMA_CLK_DIV_NUM_V)<<(SYS_CLKRST_GDMA_CLK_DIV_NUM_S))
#define SYS_CLKRST_GDMA_CLK_DIV_NUM_V  0xFF
#define SYS_CLKRST_GDMA_CLK_DIV_NUM_S  8
/* SYS_CLKRST_GDMA_FORCE_NORST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: software force no reset.*/
#define SYS_CLKRST_GDMA_FORCE_NORST    (BIT(5))
#define SYS_CLKRST_GDMA_FORCE_NORST_M  (BIT(5))
#define SYS_CLKRST_GDMA_FORCE_NORST_V  0x1
#define SYS_CLKRST_GDMA_FORCE_NORST_S  5
/* SYS_CLKRST_GDMA_RSTN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: software reset : low active.*/
#define SYS_CLKRST_GDMA_RSTN    (BIT(4))
#define SYS_CLKRST_GDMA_RSTN_M  (BIT(4))
#define SYS_CLKRST_GDMA_RSTN_V  0x1
#define SYS_CLKRST_GDMA_RSTN_S  4
/* SYS_CLKRST_GDMA_APB_CLK_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: apb clock enable.*/
#define SYS_CLKRST_GDMA_APB_CLK_EN    (BIT(3))
#define SYS_CLKRST_GDMA_APB_CLK_EN_M  (BIT(3))
#define SYS_CLKRST_GDMA_APB_CLK_EN_V  0x1
#define SYS_CLKRST_GDMA_APB_CLK_EN_S  3
/* SYS_CLKRST_GDMA_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: clock force sync enable : clock output only available when clock is synced.*/
#define SYS_CLKRST_GDMA_CLK_FORCE_SYNC_EN    (BIT(2))
#define SYS_CLKRST_GDMA_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define SYS_CLKRST_GDMA_CLK_FORCE_SYNC_EN_V  0x1
#define SYS_CLKRST_GDMA_CLK_FORCE_SYNC_EN_S  2
/* SYS_CLKRST_GDMA_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: clock sync enable : will adjust clock phase when receive clock sync signal.*/
#define SYS_CLKRST_GDMA_CLK_SYNC_EN    (BIT(1))
#define SYS_CLKRST_GDMA_CLK_SYNC_EN_M  (BIT(1))
#define SYS_CLKRST_GDMA_CLK_SYNC_EN_V  0x1
#define SYS_CLKRST_GDMA_CLK_SYNC_EN_S  1
/* SYS_CLKRST_GDMA_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: clock output enable.*/
#define SYS_CLKRST_GDMA_CLK_EN    (BIT(0))
#define SYS_CLKRST_GDMA_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_GDMA_CLK_EN_V  0x1
#define SYS_CLKRST_GDMA_CLK_EN_S  0

#define SYS_CLKRST_USBOTG_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x34)
/* SYS_CLKRST_USBOTG_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: .*/
#define SYS_CLKRST_USBOTG_CLK_CUR_DIV_NUM    0x000000FF
#define SYS_CLKRST_USBOTG_CLK_CUR_DIV_NUM_M  ((SYS_CLKRST_USBOTG_CLK_CUR_DIV_NUM_V)<<(SYS_CLKRST_USBOTG_CLK_CUR_DIV_NUM_S))
#define SYS_CLKRST_USBOTG_CLK_CUR_DIV_NUM_V  0xFF
#define SYS_CLKRST_USBOTG_CLK_CUR_DIV_NUM_S  24
/* SYS_CLKRST_USBOTG_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: .*/
#define SYS_CLKRST_USBOTG_CLK_PHASE_OFFSET    0x000000FF
#define SYS_CLKRST_USBOTG_CLK_PHASE_OFFSET_M  ((SYS_CLKRST_USBOTG_CLK_PHASE_OFFSET_V)<<(SYS_CLKRST_USBOTG_CLK_PHASE_OFFSET_S))
#define SYS_CLKRST_USBOTG_CLK_PHASE_OFFSET_V  0xFF
#define SYS_CLKRST_USBOTG_CLK_PHASE_OFFSET_S  16
/* SYS_CLKRST_USBOTG_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: .*/
#define SYS_CLKRST_USBOTG_CLK_DIV_NUM    0x000000FF
#define SYS_CLKRST_USBOTG_CLK_DIV_NUM_M  ((SYS_CLKRST_USBOTG_CLK_DIV_NUM_V)<<(SYS_CLKRST_USBOTG_CLK_DIV_NUM_S))
#define SYS_CLKRST_USBOTG_CLK_DIV_NUM_V  0xFF
#define SYS_CLKRST_USBOTG_CLK_DIV_NUM_S  8
/* SYS_CLKRST_USBOTG_FORCE_NORST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_USBOTG_FORCE_NORST    (BIT(5))
#define SYS_CLKRST_USBOTG_FORCE_NORST_M  (BIT(5))
#define SYS_CLKRST_USBOTG_FORCE_NORST_V  0x1
#define SYS_CLKRST_USBOTG_FORCE_NORST_S  5
/* SYS_CLKRST_USBOTG_RSTN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_USBOTG_RSTN    (BIT(4))
#define SYS_CLKRST_USBOTG_RSTN_M  (BIT(4))
#define SYS_CLKRST_USBOTG_RSTN_V  0x1
#define SYS_CLKRST_USBOTG_RSTN_S  4
/* SYS_CLKRST_USBOTG_APB_CLK_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_USBOTG_APB_CLK_EN    (BIT(3))
#define SYS_CLKRST_USBOTG_APB_CLK_EN_M  (BIT(3))
#define SYS_CLKRST_USBOTG_APB_CLK_EN_V  0x1
#define SYS_CLKRST_USBOTG_APB_CLK_EN_S  3
/* SYS_CLKRST_USBOTG_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_USBOTG_CLK_FORCE_SYNC_EN    (BIT(2))
#define SYS_CLKRST_USBOTG_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define SYS_CLKRST_USBOTG_CLK_FORCE_SYNC_EN_V  0x1
#define SYS_CLKRST_USBOTG_CLK_FORCE_SYNC_EN_S  2
/* SYS_CLKRST_USBOTG_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_USBOTG_CLK_SYNC_EN    (BIT(1))
#define SYS_CLKRST_USBOTG_CLK_SYNC_EN_M  (BIT(1))
#define SYS_CLKRST_USBOTG_CLK_SYNC_EN_V  0x1
#define SYS_CLKRST_USBOTG_CLK_SYNC_EN_S  1
/* SYS_CLKRST_USBOTG_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_USBOTG_CLK_EN    (BIT(0))
#define SYS_CLKRST_USBOTG_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_USBOTG_CLK_EN_V  0x1
#define SYS_CLKRST_USBOTG_CLK_EN_S  0

#define SYS_CLKRST_SDIO_SLAVE_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x38)
/* SYS_CLKRST_SDIO_SLAVE_CLK_CUR_DIV_NUM : RO ;bitpos:[31:24] ;default: 8'h0 ; */
/*description: .*/
#define SYS_CLKRST_SDIO_SLAVE_CLK_CUR_DIV_NUM    0x000000FF
#define SYS_CLKRST_SDIO_SLAVE_CLK_CUR_DIV_NUM_M  ((SYS_CLKRST_SDIO_SLAVE_CLK_CUR_DIV_NUM_V)<<(SYS_CLKRST_SDIO_SLAVE_CLK_CUR_DIV_NUM_S))
#define SYS_CLKRST_SDIO_SLAVE_CLK_CUR_DIV_NUM_V  0xFF
#define SYS_CLKRST_SDIO_SLAVE_CLK_CUR_DIV_NUM_S  24
/* SYS_CLKRST_SDIO_SLAVE_CLK_PHASE_OFFSET : R/W ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: .*/
#define SYS_CLKRST_SDIO_SLAVE_CLK_PHASE_OFFSET    0x000000FF
#define SYS_CLKRST_SDIO_SLAVE_CLK_PHASE_OFFSET_M  ((SYS_CLKRST_SDIO_SLAVE_CLK_PHASE_OFFSET_V)<<(SYS_CLKRST_SDIO_SLAVE_CLK_PHASE_OFFSET_S))
#define SYS_CLKRST_SDIO_SLAVE_CLK_PHASE_OFFSET_V  0xFF
#define SYS_CLKRST_SDIO_SLAVE_CLK_PHASE_OFFSET_S  16
/* SYS_CLKRST_SDIO_SLAVE_CLK_DIV_NUM : R/W ;bitpos:[15:8] ;default: 8'h0 ; */
/*description: .*/
#define SYS_CLKRST_SDIO_SLAVE_CLK_DIV_NUM    0x000000FF
#define SYS_CLKRST_SDIO_SLAVE_CLK_DIV_NUM_M  ((SYS_CLKRST_SDIO_SLAVE_CLK_DIV_NUM_V)<<(SYS_CLKRST_SDIO_SLAVE_CLK_DIV_NUM_S))
#define SYS_CLKRST_SDIO_SLAVE_CLK_DIV_NUM_V  0xFF
#define SYS_CLKRST_SDIO_SLAVE_CLK_DIV_NUM_S  8
/* SYS_CLKRST_SDIO_SLAVE_FORCE_NORST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_SDIO_SLAVE_FORCE_NORST    (BIT(5))
#define SYS_CLKRST_SDIO_SLAVE_FORCE_NORST_M  (BIT(5))
#define SYS_CLKRST_SDIO_SLAVE_FORCE_NORST_V  0x1
#define SYS_CLKRST_SDIO_SLAVE_FORCE_NORST_S  5
/* SYS_CLKRST_SDIO_SLAVE_RSTN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_SDIO_SLAVE_RSTN    (BIT(4))
#define SYS_CLKRST_SDIO_SLAVE_RSTN_M  (BIT(4))
#define SYS_CLKRST_SDIO_SLAVE_RSTN_V  0x1
#define SYS_CLKRST_SDIO_SLAVE_RSTN_S  4
/* SYS_CLKRST_SDIO_SLAVE_CLK_FORCE_SYNC_EN : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_SDIO_SLAVE_CLK_FORCE_SYNC_EN    (BIT(2))
#define SYS_CLKRST_SDIO_SLAVE_CLK_FORCE_SYNC_EN_M  (BIT(2))
#define SYS_CLKRST_SDIO_SLAVE_CLK_FORCE_SYNC_EN_V  0x1
#define SYS_CLKRST_SDIO_SLAVE_CLK_FORCE_SYNC_EN_S  2
/* SYS_CLKRST_SDIO_SLAVE_CLK_SYNC_EN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_SDIO_SLAVE_CLK_SYNC_EN    (BIT(1))
#define SYS_CLKRST_SDIO_SLAVE_CLK_SYNC_EN_M  (BIT(1))
#define SYS_CLKRST_SDIO_SLAVE_CLK_SYNC_EN_V  0x1
#define SYS_CLKRST_SDIO_SLAVE_CLK_SYNC_EN_S  1
/* SYS_CLKRST_SDIO_SLAVE_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_SDIO_SLAVE_CLK_EN    (BIT(0))
#define SYS_CLKRST_SDIO_SLAVE_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_SDIO_SLAVE_CLK_EN_V  0x1
#define SYS_CLKRST_SDIO_SLAVE_CLK_EN_S  0

#define SYS_CLKRST_ISP_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x40)
/* SYS_CLKRST_ISP_CLK_DIV_NUM : R/W ;bitpos:[6:3] ;default: 4'd1 ; */
/*description: .*/
#define SYS_CLKRST_ISP_CLK_DIV_NUM    0x0000000F
#define SYS_CLKRST_ISP_CLK_DIV_NUM_M  ((SYS_CLKRST_ISP_CLK_DIV_NUM_V)<<(SYS_CLKRST_ISP_CLK_DIV_NUM_S))
#define SYS_CLKRST_ISP_CLK_DIV_NUM_V  0xF
#define SYS_CLKRST_ISP_CLK_DIV_NUM_S  3
/* SYS_CLKRST_ISP_FORCE_NORST : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_ISP_FORCE_NORST    (BIT(2))
#define SYS_CLKRST_ISP_FORCE_NORST_M  (BIT(2))
#define SYS_CLKRST_ISP_FORCE_NORST_V  0x1
#define SYS_CLKRST_ISP_FORCE_NORST_S  2
/* SYS_CLKRST_ISP_RSTN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_ISP_RSTN    (BIT(1))
#define SYS_CLKRST_ISP_RSTN_M  (BIT(1))
#define SYS_CLKRST_ISP_RSTN_V  0x1
#define SYS_CLKRST_ISP_RSTN_S  1
/* SYS_CLKRST_ISP_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_ISP_CLK_EN    (BIT(0))
#define SYS_CLKRST_ISP_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_ISP_CLK_EN_V  0x1
#define SYS_CLKRST_ISP_CLK_EN_S  0

#define SYS_CLKRST_DMA2D_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x44)
/* SYS_CLKRST_DMA2D_FORCE_NORST : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_DMA2D_FORCE_NORST    (BIT(2))
#define SYS_CLKRST_DMA2D_FORCE_NORST_M  (BIT(2))
#define SYS_CLKRST_DMA2D_FORCE_NORST_V  0x1
#define SYS_CLKRST_DMA2D_FORCE_NORST_S  2
/* SYS_CLKRST_DMA2D_RSTN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_DMA2D_RSTN    (BIT(1))
#define SYS_CLKRST_DMA2D_RSTN_M  (BIT(1))
#define SYS_CLKRST_DMA2D_RSTN_V  0x1
#define SYS_CLKRST_DMA2D_RSTN_S  1
/* SYS_CLKRST_DMA2D_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_DMA2D_CLK_EN    (BIT(0))
#define SYS_CLKRST_DMA2D_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_DMA2D_CLK_EN_V  0x1
#define SYS_CLKRST_DMA2D_CLK_EN_S  0

#define SYS_CLKRST_PPA_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x48)
/* SYS_CLKRST_PPA_FORCE_NORST : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_PPA_FORCE_NORST    (BIT(2))
#define SYS_CLKRST_PPA_FORCE_NORST_M  (BIT(2))
#define SYS_CLKRST_PPA_FORCE_NORST_V  0x1
#define SYS_CLKRST_PPA_FORCE_NORST_S  2
/* SYS_CLKRST_PPA_RSTN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_PPA_RSTN    (BIT(1))
#define SYS_CLKRST_PPA_RSTN_M  (BIT(1))
#define SYS_CLKRST_PPA_RSTN_V  0x1
#define SYS_CLKRST_PPA_RSTN_S  1
/* SYS_CLKRST_PPA_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_PPA_CLK_EN    (BIT(0))
#define SYS_CLKRST_PPA_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_PPA_CLK_EN_V  0x1
#define SYS_CLKRST_PPA_CLK_EN_S  0

#define SYS_CLKRST_GDMA_DBG_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x50)
/* SYS_CLKRST_DEBUG_CH_NUM : R/W ;bitpos:[1:0] ;default: 2'h0 ; */
/*description: .*/
#define SYS_CLKRST_DEBUG_CH_NUM    0x00000003
#define SYS_CLKRST_DEBUG_CH_NUM_M  ((SYS_CLKRST_DEBUG_CH_NUM_V)<<(SYS_CLKRST_DEBUG_CH_NUM_S))
#define SYS_CLKRST_DEBUG_CH_NUM_V  0x3
#define SYS_CLKRST_DEBUG_CH_NUM_S  0

