espressif/esp-idf/components/soc/esp32p4/include/soc/sys_clkrst_reg.h
#define SYS_CLKRST_GMAC_PTP_RD0_REG          (DR_REG_SYS_CLKRST_BASE + 0x54)
/* SYS_CLKRST_PTP_TIMESTAMP_LO : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SYS_CLKRST_PTP_TIMESTAMP_LO    0xFFFFFFFF
#define SYS_CLKRST_PTP_TIMESTAMP_LO_M  ((SYS_CLKRST_PTP_TIMESTAMP_LO_V)<<(SYS_CLKRST_PTP_TIMESTAMP_LO_S))
#define SYS_CLKRST_PTP_TIMESTAMP_LO_V  0xFFFFFFFF
#define SYS_CLKRST_PTP_TIMESTAMP_LO_S  0

#define SYS_CLKRST_GMAC_PTP_RD1_REG          (DR_REG_SYS_CLKRST_BASE + 0x58)
/* SYS_CLKRST_PTP_TIMESTAMP_HI : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: .*/
#define SYS_CLKRST_PTP_TIMESTAMP_HI    0xFFFFFFFF
#define SYS_CLKRST_PTP_TIMESTAMP_HI_M  ((SYS_CLKRST_PTP_TIMESTAMP_HI_V)<<(SYS_CLKRST_PTP_TIMESTAMP_HI_S))
#define SYS_CLKRST_PTP_TIMESTAMP_HI_V  0xFFFFFFFF
#define SYS_CLKRST_PTP_TIMESTAMP_HI_S  0

#define SYS_CLKRST_GMAC_PTP_PPS_REG          (DR_REG_SYS_CLKRST_BASE + 0x5C)
/* SYS_CLKRST_PTP_PPS : RO ;bitpos:[0] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_PTP_PPS    (BIT(0))
#define SYS_CLKRST_PTP_PPS_M  (BIT(0))
#define SYS_CLKRST_PTP_PPS_V  0x1
#define SYS_CLKRST_PTP_PPS_S  0

#define SYS_CLKRST_GMAC_CLK_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x60)
/* SYS_CLKRST_GMAC_FUNC_RX_CLK_FORCE_ON : R/W ;bitpos:[13] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_GMAC_FUNC_RX_CLK_FORCE_ON    (BIT(13))
#define SYS_CLKRST_GMAC_FUNC_RX_CLK_FORCE_ON_M  (BIT(13))
#define SYS_CLKRST_GMAC_FUNC_RX_CLK_FORCE_ON_V  0x1
#define SYS_CLKRST_GMAC_FUNC_RX_CLK_FORCE_ON_S  13
/* SYS_CLKRST_GMAC_FUNC_TX_CLK_FORCE_ON : R/W ;bitpos:[12] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_GMAC_FUNC_TX_CLK_FORCE_ON    (BIT(12))
#define SYS_CLKRST_GMAC_FUNC_TX_CLK_FORCE_ON_M  (BIT(12))
#define SYS_CLKRST_GMAC_FUNC_TX_CLK_FORCE_ON_V  0x1
#define SYS_CLKRST_GMAC_FUNC_TX_CLK_FORCE_ON_S  12
/* SYS_CLKRST_GMAC_FUNC_RX_CLK_EN : R/W ;bitpos:[11] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_GMAC_FUNC_RX_CLK_EN    (BIT(11))
#define SYS_CLKRST_GMAC_FUNC_RX_CLK_EN_M  (BIT(11))
#define SYS_CLKRST_GMAC_FUNC_RX_CLK_EN_V  0x1
#define SYS_CLKRST_GMAC_FUNC_RX_CLK_EN_S  11
/* SYS_CLKRST_GMAC_FUNC_TX_CLK_EN : R/W ;bitpos:[10] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_GMAC_FUNC_TX_CLK_EN    (BIT(10))
#define SYS_CLKRST_GMAC_FUNC_TX_CLK_EN_M  (BIT(10))
#define SYS_CLKRST_GMAC_FUNC_TX_CLK_EN_V  0x1
#define SYS_CLKRST_GMAC_FUNC_TX_CLK_EN_S  10
/* SYS_CLKRST_GMAC_MEM_CLK_FORCE_ON : R/W ;bitpos:[9] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_GMAC_MEM_CLK_FORCE_ON    (BIT(9))
#define SYS_CLKRST_GMAC_MEM_CLK_FORCE_ON_M  (BIT(9))
#define SYS_CLKRST_GMAC_MEM_CLK_FORCE_ON_V  0x1
#define SYS_CLKRST_GMAC_MEM_CLK_FORCE_ON_S  9
/* SYS_CLKRST_REVMII_PMA_CLK_EN : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_REVMII_PMA_CLK_EN    (BIT(8))
#define SYS_CLKRST_REVMII_PMA_CLK_EN_M  (BIT(8))
#define SYS_CLKRST_REVMII_PMA_CLK_EN_V  0x1
#define SYS_CLKRST_REVMII_PMA_CLK_EN_S  8
/* SYS_CLKRST_RMII_CLK_PORT_SEL : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_RMII_CLK_PORT_SEL    (BIT(7))
#define SYS_CLKRST_RMII_CLK_PORT_SEL_M  (BIT(7))
#define SYS_CLKRST_RMII_CLK_PORT_SEL_V  0x1
#define SYS_CLKRST_RMII_CLK_PORT_SEL_S  7
/* SYS_CLKRST_SBD_FLOWCTRL : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_SBD_FLOWCTRL    (BIT(6))
#define SYS_CLKRST_SBD_FLOWCTRL_M  (BIT(6))
#define SYS_CLKRST_SBD_FLOWCTRL_V  0x1
#define SYS_CLKRST_SBD_FLOWCTRL_S  6
/* SYS_CLKRST_PHY_INTF_SEL : R/W ;bitpos:[5:3] ;default: 3'b0 ; */
/*description: .*/
#define SYS_CLKRST_PHY_INTF_SEL    0x00000007
#define SYS_CLKRST_PHY_INTF_SEL_M  ((SYS_CLKRST_PHY_INTF_SEL_V)<<(SYS_CLKRST_PHY_INTF_SEL_S))
#define SYS_CLKRST_PHY_INTF_SEL_V  0x7
#define SYS_CLKRST_PHY_INTF_SEL_S  3
/* SYS_CLKRST_PTP_REF_CLK_SEL : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_PTP_REF_CLK_SEL    (BIT(2))
#define SYS_CLKRST_PTP_REF_CLK_SEL_M  (BIT(2))
#define SYS_CLKRST_PTP_REF_CLK_SEL_V  0x1
#define SYS_CLKRST_PTP_REF_CLK_SEL_S  2
/* SYS_CLKRST_REVERSE_GMAC_TX : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_REVERSE_GMAC_TX    (BIT(1))
#define SYS_CLKRST_REVERSE_GMAC_TX_M  (BIT(1))
#define SYS_CLKRST_REVERSE_GMAC_TX_V  0x1
#define SYS_CLKRST_REVERSE_GMAC_TX_S  1
/* SYS_CLKRST_REVERSE_GMAC_RX : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_REVERSE_GMAC_RX    (BIT(0))
#define SYS_CLKRST_REVERSE_GMAC_RX_M  (BIT(0))
#define SYS_CLKRST_REVERSE_GMAC_RX_V  0x1
#define SYS_CLKRST_REVERSE_GMAC_RX_S  0

#define SYS_CLKRST_OTG_PHY_CLK_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x64)
/* SYS_CLKRST_OTG_EXT_PHY_SEL : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_OTG_EXT_PHY_SEL    (BIT(10))
#define SYS_CLKRST_OTG_EXT_PHY_SEL_M  (BIT(10))
#define SYS_CLKRST_OTG_EXT_PHY_SEL_V  0x1
#define SYS_CLKRST_OTG_EXT_PHY_SEL_S  10
/* SYS_CLKRST_PHY_REF_CLK_SEL : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_PHY_REF_CLK_SEL    (BIT(9))
#define SYS_CLKRST_PHY_REF_CLK_SEL_M  (BIT(9))
#define SYS_CLKRST_PHY_REF_CLK_SEL_V  0x1
#define SYS_CLKRST_PHY_REF_CLK_SEL_S  9
/* SYS_CLKRST_PHY_RESET_FORCE_EN : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_PHY_RESET_FORCE_EN    (BIT(8))
#define SYS_CLKRST_PHY_RESET_FORCE_EN_M  (BIT(8))
#define SYS_CLKRST_PHY_RESET_FORCE_EN_V  0x1
#define SYS_CLKRST_PHY_RESET_FORCE_EN_S  8
/* SYS_CLKRST_PHY_RSTN : R/W ;bitpos:[7] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_PHY_RSTN    (BIT(7))
#define SYS_CLKRST_PHY_RSTN_M  (BIT(7))
#define SYS_CLKRST_PHY_RSTN_V  0x1
#define SYS_CLKRST_PHY_RSTN_S  7
/* SYS_CLKRST_PHY_PLL_FORCE_EN : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_PHY_PLL_FORCE_EN    (BIT(6))
#define SYS_CLKRST_PHY_PLL_FORCE_EN_M  (BIT(6))
#define SYS_CLKRST_PHY_PLL_FORCE_EN_V  0x1
#define SYS_CLKRST_PHY_PLL_FORCE_EN_S  6
/* SYS_CLKRST_PHY_PLL_EN : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_PHY_PLL_EN    (BIT(5))
#define SYS_CLKRST_PHY_PLL_EN_M  (BIT(5))
#define SYS_CLKRST_PHY_PLL_EN_V  0x1
#define SYS_CLKRST_PHY_PLL_EN_S  5
/* SYS_CLKRST_PHY_SUSPEND_FORCE_EN : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_PHY_SUSPEND_FORCE_EN    (BIT(4))
#define SYS_CLKRST_PHY_SUSPEND_FORCE_EN_M  (BIT(4))
#define SYS_CLKRST_PHY_SUSPEND_FORCE_EN_V  0x1
#define SYS_CLKRST_PHY_SUSPEND_FORCE_EN_S  4
/* SYS_CLKRST_PHY_SUSPENDM : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_PHY_SUSPENDM    (BIT(3))
#define SYS_CLKRST_PHY_SUSPENDM_M  (BIT(3))
#define SYS_CLKRST_PHY_SUSPENDM_V  0x1
#define SYS_CLKRST_PHY_SUSPENDM_S  3
/* SYS_CLKRST_OTG_PHY_TXBITSTUFF_EN : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_OTG_PHY_TXBITSTUFF_EN    (BIT(2))
#define SYS_CLKRST_OTG_PHY_TXBITSTUFF_EN_M  (BIT(2))
#define SYS_CLKRST_OTG_PHY_TXBITSTUFF_EN_V  0x1
#define SYS_CLKRST_OTG_PHY_TXBITSTUFF_EN_S  2
/* SYS_CLKRST_OTG_SUSPENDM : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_OTG_SUSPENDM    (BIT(1))
#define SYS_CLKRST_OTG_SUSPENDM_M  (BIT(1))
#define SYS_CLKRST_OTG_SUSPENDM_V  0x1
#define SYS_CLKRST_OTG_SUSPENDM_S  1
/* SYS_CLKRST_OTG_PHY_REFCLK_MODE : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_OTG_PHY_REFCLK_MODE    (BIT(0))
#define SYS_CLKRST_OTG_PHY_REFCLK_MODE_M  (BIT(0))
#define SYS_CLKRST_OTG_PHY_REFCLK_MODE_V  0x1
#define SYS_CLKRST_OTG_PHY_REFCLK_MODE_S  0

