espressif/esp-idf/components/soc/esp32p4/include/soc/sys_clkrst_reg.h
#define SYS_CLKRST_SYS_PERI_APB_POSTW_CNTL_REG          (DR_REG_SYS_CLKRST_BASE + 0x68)
/* SYS_CLKRST_DSI_HOST_APB_POSTW_EN : R/W ;bitpos:[6] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_DSI_HOST_APB_POSTW_EN    (BIT(6))
#define SYS_CLKRST_DSI_HOST_APB_POSTW_EN_M  (BIT(6))
#define SYS_CLKRST_DSI_HOST_APB_POSTW_EN_V  0x1
#define SYS_CLKRST_DSI_HOST_APB_POSTW_EN_S  6
/* SYS_CLKRST_CSI_HOST_APB_POSTW_EN : R/W ;bitpos:[5] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_CSI_HOST_APB_POSTW_EN    (BIT(5))
#define SYS_CLKRST_CSI_HOST_APB_POSTW_EN_M  (BIT(5))
#define SYS_CLKRST_CSI_HOST_APB_POSTW_EN_V  0x1
#define SYS_CLKRST_CSI_HOST_APB_POSTW_EN_S  5
/* SYS_CLKRST_SDIO_SLAVE_APB_POSTW_EN : R/W ;bitpos:[4] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_SDIO_SLAVE_APB_POSTW_EN    (BIT(4))
#define SYS_CLKRST_SDIO_SLAVE_APB_POSTW_EN_M  (BIT(4))
#define SYS_CLKRST_SDIO_SLAVE_APB_POSTW_EN_V  0x1
#define SYS_CLKRST_SDIO_SLAVE_APB_POSTW_EN_S  4
/* SYS_CLKRST_USB11_APB_POSTW_EN : R/W ;bitpos:[3] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_USB11_APB_POSTW_EN    (BIT(3))
#define SYS_CLKRST_USB11_APB_POSTW_EN_M  (BIT(3))
#define SYS_CLKRST_USB11_APB_POSTW_EN_V  0x1
#define SYS_CLKRST_USB11_APB_POSTW_EN_S  3
/* SYS_CLKRST_DMA2D_APB_POSTW_EN : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_DMA2D_APB_POSTW_EN    (BIT(2))
#define SYS_CLKRST_DMA2D_APB_POSTW_EN_M  (BIT(2))
#define SYS_CLKRST_DMA2D_APB_POSTW_EN_V  0x1
#define SYS_CLKRST_DMA2D_APB_POSTW_EN_S  2
/* SYS_CLKRST_JPEG_APB_POSTW_EN : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_JPEG_APB_POSTW_EN    (BIT(1))
#define SYS_CLKRST_JPEG_APB_POSTW_EN_M  (BIT(1))
#define SYS_CLKRST_JPEG_APB_POSTW_EN_V  0x1
#define SYS_CLKRST_JPEG_APB_POSTW_EN_S  1
/* SYS_CLKRST_GMAC_APB_POSTW_EN : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_GMAC_APB_POSTW_EN    (BIT(0))
#define SYS_CLKRST_GMAC_APB_POSTW_EN_M  (BIT(0))
#define SYS_CLKRST_GMAC_APB_POSTW_EN_V  0x1
#define SYS_CLKRST_GMAC_APB_POSTW_EN_S  0

#define SYS_CLKRST_SYS_LSLP_MEM_PD_REG          (DR_REG_SYS_CLKRST_BASE + 0x6C)
/* SYS_CLKRST_JPEG_SDSLP_MEM_PD : R/W ;bitpos:[4] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_JPEG_SDSLP_MEM_PD    (BIT(4))
#define SYS_CLKRST_JPEG_SDSLP_MEM_PD_M  (BIT(4))
#define SYS_CLKRST_JPEG_SDSLP_MEM_PD_V  0x1
#define SYS_CLKRST_JPEG_SDSLP_MEM_PD_S  4
/* SYS_CLKRST_JPEG_DSLP_MEM_PD : R/W ;bitpos:[3] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_JPEG_DSLP_MEM_PD    (BIT(3))
#define SYS_CLKRST_JPEG_DSLP_MEM_PD_M  (BIT(3))
#define SYS_CLKRST_JPEG_DSLP_MEM_PD_V  0x1
#define SYS_CLKRST_JPEG_DSLP_MEM_PD_S  3
/* SYS_CLKRST_JPEG_LSLP_MEM_PD : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_JPEG_LSLP_MEM_PD    (BIT(2))
#define SYS_CLKRST_JPEG_LSLP_MEM_PD_M  (BIT(2))
#define SYS_CLKRST_JPEG_LSLP_MEM_PD_V  0x1
#define SYS_CLKRST_JPEG_LSLP_MEM_PD_S  2
/* SYS_CLKRST_PPA_LSLP_MEM_PD : R/W ;bitpos:[1] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_PPA_LSLP_MEM_PD    (BIT(1))
#define SYS_CLKRST_PPA_LSLP_MEM_PD_M  (BIT(1))
#define SYS_CLKRST_PPA_LSLP_MEM_PD_V  0x1
#define SYS_CLKRST_PPA_LSLP_MEM_PD_S  1
/* SYS_CLKRST_DMA2D_LSLP_MEM_PD : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_DMA2D_LSLP_MEM_PD    (BIT(0))
#define SYS_CLKRST_DMA2D_LSLP_MEM_PD_M  (BIT(0))
#define SYS_CLKRST_DMA2D_LSLP_MEM_PD_V  0x1
#define SYS_CLKRST_DMA2D_LSLP_MEM_PD_S  0

#define SYS_CLKRST_ECO_CELL_EN_AND_DATA_REG          (DR_REG_SYS_CLKRST_BASE + 0x70)
/* SYS_CLKRST_CLK_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_CLK_EN    (BIT(3))
#define SYS_CLKRST_CLK_EN_M  (BIT(3))
#define SYS_CLKRST_CLK_EN_V  0x1
#define SYS_CLKRST_CLK_EN_S  3
/* SYS_CLKRST_BIT_IN : R/W ;bitpos:[2] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_BIT_IN    (BIT(2))
#define SYS_CLKRST_BIT_IN_M  (BIT(2))
#define SYS_CLKRST_BIT_IN_V  0x1
#define SYS_CLKRST_BIT_IN_S  2
/* SYS_CLKRST_BIT_OUT : RO ;bitpos:[1] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_BIT_OUT    (BIT(1))
#define SYS_CLKRST_BIT_OUT_M  (BIT(1))
#define SYS_CLKRST_BIT_OUT_V  0x1
#define SYS_CLKRST_BIT_OUT_S  1
/* SYS_CLKRST_EN : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: .*/
#define SYS_CLKRST_EN    (BIT(0))
#define SYS_CLKRST_EN_M  (BIT(0))
#define SYS_CLKRST_EN_V  0x1
#define SYS_CLKRST_EN_S  0

#define SYS_CLKRST_USB_MEM_AUX_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x74)
/* SYS_CLKRST_OTG_PHY_BISTEN : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_OTG_PHY_BISTEN    (BIT(15))
#define SYS_CLKRST_OTG_PHY_BISTEN_M  (BIT(15))
#define SYS_CLKRST_OTG_PHY_BISTEN_V  0x1
#define SYS_CLKRST_OTG_PHY_BISTEN_S  15
/* SYS_CLKRST_OTG_PHY_TEST_DONE : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_OTG_PHY_TEST_DONE    (BIT(14))
#define SYS_CLKRST_OTG_PHY_TEST_DONE_M  (BIT(14))
#define SYS_CLKRST_OTG_PHY_TEST_DONE_V  0x1
#define SYS_CLKRST_OTG_PHY_TEST_DONE_S  14
/* SYS_CLKRST_USB_MEM_AUX_CTRL : R/W ;bitpos:[13:0] ;default: 14'h1320 ; */
/*description: .*/
#define SYS_CLKRST_USB_MEM_AUX_CTRL    0x00003FFF
#define SYS_CLKRST_USB_MEM_AUX_CTRL_M  ((SYS_CLKRST_USB_MEM_AUX_CTRL_V)<<(SYS_CLKRST_USB_MEM_AUX_CTRL_S))
#define SYS_CLKRST_USB_MEM_AUX_CTRL_V  0x3FFF
#define SYS_CLKRST_USB_MEM_AUX_CTRL_S  0

#define SYS_CLKRST_DUAL_MSPI_CTRL_REG          (DR_REG_SYS_CLKRST_BASE + 0x78)
/* SYS_CLKRST_DUAL_MSPI_FORCE_NORST : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_DUAL_MSPI_FORCE_NORST    (BIT(2))
#define SYS_CLKRST_DUAL_MSPI_FORCE_NORST_M  (BIT(2))
#define SYS_CLKRST_DUAL_MSPI_FORCE_NORST_V  0x1
#define SYS_CLKRST_DUAL_MSPI_FORCE_NORST_S  2
/* SYS_CLKRST_DUAL_MSPI_RSTN : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_DUAL_MSPI_RSTN    (BIT(1))
#define SYS_CLKRST_DUAL_MSPI_RSTN_M  (BIT(1))
#define SYS_CLKRST_DUAL_MSPI_RSTN_V  0x1
#define SYS_CLKRST_DUAL_MSPI_RSTN_S  1
/* SYS_CLKRST_DUAL_MSPI_APB_CLK_EN : R/W ;bitpos:[0] ;default: 1'b1 ; */
/*description: .*/
#define SYS_CLKRST_DUAL_MSPI_APB_CLK_EN    (BIT(0))
#define SYS_CLKRST_DUAL_MSPI_APB_CLK_EN_M  (BIT(0))
#define SYS_CLKRST_DUAL_MSPI_APB_CLK_EN_V  0x1
#define SYS_CLKRST_DUAL_MSPI_APB_CLK_EN_S  0

