espressif/esp-idf/components/soc/esp32p4/include/soc/sys_clkrst_reg.h
#define SYS_CLKRST_HP_PERI_RDN_ECO_CS_REG          (DR_REG_SYS_CLKRST_BASE + 0x7C)
/* SYS_CLKRST_HP_PERI_RDN_ECO_RESULT : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_HP_PERI_RDN_ECO_RESULT    (BIT(1))
#define SYS_CLKRST_HP_PERI_RDN_ECO_RESULT_M  (BIT(1))
#define SYS_CLKRST_HP_PERI_RDN_ECO_RESULT_V  0x1
#define SYS_CLKRST_HP_PERI_RDN_ECO_RESULT_S  1
/* SYS_CLKRST_HP_PERI_RDN_ECO_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: .*/
#define SYS_CLKRST_HP_PERI_RDN_ECO_EN    (BIT(0))
#define SYS_CLKRST_HP_PERI_RDN_ECO_EN_M  (BIT(0))
#define SYS_CLKRST_HP_PERI_RDN_ECO_EN_V  0x1
#define SYS_CLKRST_HP_PERI_RDN_ECO_EN_S  0

#define SYS_CLKRST_HP_PERI_RDN_ECO_LOW_REG          (DR_REG_SYS_CLKRST_BASE + 0x80)
/* SYS_CLKRST_HP_PERI_RDN_ECO_LOW : R/W ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: .*/
#define SYS_CLKRST_HP_PERI_RDN_ECO_LOW    0xFFFFFFFF
#define SYS_CLKRST_HP_PERI_RDN_ECO_LOW_M  ((SYS_CLKRST_HP_PERI_RDN_ECO_LOW_V)<<(SYS_CLKRST_HP_PERI_RDN_ECO_LOW_S))
#define SYS_CLKRST_HP_PERI_RDN_ECO_LOW_V  0xFFFFFFFF
#define SYS_CLKRST_HP_PERI_RDN_ECO_LOW_S  0

#define SYS_CLKRST_HP_PERI_RDN_ECO_HIGH_REG          (DR_REG_SYS_CLKRST_BASE + 0x84)
/* SYS_CLKRST_HP_PERI_RDN_ECO_HIGH : R/W ;bitpos:[31:0] ;default: 32'hffffffff ; */
/*description: .*/
#define SYS_CLKRST_HP_PERI_RDN_ECO_HIGH    0xFFFFFFFF
#define SYS_CLKRST_HP_PERI_RDN_ECO_HIGH_M  ((SYS_CLKRST_HP_PERI_RDN_ECO_HIGH_V)<<(SYS_CLKRST_HP_PERI_RDN_ECO_HIGH_S))
#define SYS_CLKRST_HP_PERI_RDN_ECO_HIGH_V  0xFFFFFFFF
#define SYS_CLKRST_HP_PERI_RDN_ECO_HIGH_S  0


#ifdef __cplusplus
}
#endif



#endif /*_SOC_SYS_CLKRST_REG_H_ */
